Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.AddWeld Method
 Adds a weld to the logical weld.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddWeld(
	BaseWeld Weld
)
Public Function AddWeld (
	Weld As BaseWeld
) As Boolean
Parameters
Weld
Type: Tekla.Structures.Model.BaseWeld
The weld to be added.
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace